Revit 2026 API

# ElementSetErase Method

---

Removes a specified element from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	Element item
)
```
```vb
Public Overridable Function Erase (
	item As Element
) As Integer
```
```cpp
public:
virtual int Erase(
	Element^ item
)
```
```fsharp
abstract Erase :
        item : Element -> int
override Erase :
        item : Element -> int
```

#### Parameters

item Element
    The element to be erased.

#### Return Value

Int32The number of elements that were erased from the set.

#### Reference

ElementSet Class

Autodesk.Revit.DB Namespace